In [2]:
import pandas as pd
import numpy as np

In [5]:
df = pd.read_csv('./bert/glue_data/AuthorClass/train.csv')

In [7]:
df2 = df.sample(frac=0.1)

In [17]:
df2.to_csv('train_2.csv', index=False)

In [15]:
df2[['text', 'author']]

                                                    text  author
22912  nd sizes some were short legged â too short ot...      21
18293  when she saw the twinkle in his eye she knew t...      17
40167  love thou doubly hast afflicted me with virtue...      37
41588  to see us but some birds and no resource for m...      38
40894  to tempt and to betray the traveller the path ...      38
...                                                  ...     ...
22220  ll you to his place and he s getting forty fiv...      21
49260  by her husband and for the first time she wond...      45
10394  new baron that i may ask the favour of on my s...       9
18420  you had been a man you would have been an awfu...      17
48468  twenty at least â not caring to acknowledge th...      45

[5368 rows x 2 columns]

In [19]:
df2['author'].value_counts() / len(df2)

8     0.126677
26    0.082899
14    0.049925
37    0.047317
21    0.045827
45    0.041729
39    0.037258
48    0.033905
33    0.030365
15    0.028875
19    0.027571
4     0.026639
38    0.024963
25    0.023845
43    0.023286
42    0.021610
9     0.021423
1     0.020492
30    0.019933
18    0.017139
41    0.016393
32    0.014531
28    0.013785
10    0.013040
12    0.013040
50    0.012668
17    0.012295
36    0.011923
35    0.011364
46    0.010991
22    0.010991
29    0.010805
13    0.010618
20    0.010432
34    0.008383
44    0.008197
2     0.008197
23    0.008197
6     0.008010
40    0.007824
11    0.007079
27    0.006148
24    0.006148
3     0.004657
16    0.002608
Name: author, dtype: float64